MyOscillatingRotatingMotion/OscillatingMeshCase/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;

vertices
(
    (-2 -2 0)	//Punkt 0
    ( 2 -2 0)	//Punkt 1
    ( 2  2 0)	//Punkt 2
    (-2  2 0)	//Punkt 3
    (-2 -2 0.1)	//Punkt 4
    ( 2 -2 0.1)	//Punkt 5
    ( 2  2 0.1)	//Punkt 6
    (-2  2 0.1)	//Punkt 7
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (30 30 1) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    TopBottom
    {
        type patch;
        faces
        (
            	(2 3 6 7)
		(1 0 4 5)
        );
    }

    IN
    {
        type patch;
        faces
        (
            	(3 0 4 7)
        );
    }

    OUT
    {
        type patch;
        faces
        (
            	(1 2 6 5)
        );
    }

    FRONTandBACK
    {
        type empty;
        faces
        (
            	(0 1 2 3)
		(4 5 6 7)
        );
    }
);

mergePatchPairs
(
);

// ************************************************************************* //
