MyOscillatingRotatingMotion/OscillatingMeshCase/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2006                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      binary;
    class       polyBoundaryMesh;
    arch        "LSB;label=32;scalar=64";
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

9
(
    AMI0
    {
        type            cyclicAMI;
        inGroups        1(cyclicAMI);
        nFaces          29;
        startFace       1293;
        matchTolerance  0.0001;
        transform       noOrdering;
        neighbourPatch  AMI1;
        AMIMethod       faceAreaWeightAMI;
        restartUncoveredSourceFace 1;
    }
    AMI1
    {
        type            cyclicAMI;
        inGroups        1(cyclicAMI);
        nFaces          29;
        startFace       1322;
        matchTolerance  0.0001;
        transform       noOrdering;
        neighbourPatch  AMI0;
        AMIMethod       faceAreaWeightAMI;
        restartUncoveredSourceFace 1;
    }
    Inlet
    {
        type            patch;
        nFaces          9;
        startFace       1351;
    }
    Outlet
    {
        type            patch;
        nFaces          9;
        startFace       1360;
    }
    TopBottom
    {
        type            patch;
        nFaces          18;
        startFace       1369;
    }
    Wing-Bottom
    {
        type            wall;
        inGroups        1(wall);
        nFaces          22;
        startFace       1387;
    }
    Wing-Top
    {
        type            wall;
        inGroups        1(wall);
        nFaces          22;
        startFace       1409;
    }
    Base
    {
        type            empty;
        inGroups        1(empty);
        nFaces          908;
        startFace       1431;
    }
    Top
    {
        type            empty;
        inGroups        1(empty);
        nFaces          908;
        startFace       2339;
    }
)

// ************************************************************************* //
